Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Displays:
it_it: Display:

source: Division lines
it_it: Linee di divisione

source: Do not ``malloc`` into a static or global variables.
it_it: Non usare ``malloc`` in una variabile statica o globale.

source: Do not confuse the driver-identifier letter with the Windows/DOS/FAT "drive letter", which is part of the path passed to the OS-level functions.
it_it: Non confondere la lettera identificativa del driver con la "lettera del drive" di Windows/DOS/FAT, che fa parte del path passato alle funzioni a livello di sistema operativo.

source: Do not confuse this with a Windows or DOS drive letter.
it_it: Non confondere questa con una lettera di unità di Windows o DOS.

source: Do not prefix the path with the driver-identifier letter, and do append a directory separator character at the end.
it_it: Non anteporre al path la lettera identificativa del driver e aggiungere un carattere separatore di directory alla fine.

source: Do not use ``const`` strings with :cpp:func:`lv_label_set_text_static` when the Label is being used in :cpp:enumerator:`LV_LABEL_LONG_MODE_DOTS` mode since the Label will attempt to do an in-place edit of the string.
it_it: Non utilizzare stringhe ``const`` con :cpp:func:`lv_label_set_text_static` quando l'etichetta viene utilizzata in modalità :cpp:enumerator:`LV_LABEL_LONG_MODE_DOTS` poiché l'etichetta tenterà di effettuare una modifica sul posto della stringa.

source: Do not use global variables (use functions to set/get static variables).
it_it: Non utilizzare variabili globali (utilizzare funzioni per impostare/ottenere variabili statiche).

source: Do not use lone ::, :code: or ..
it_it: Non utilizzare solo ::, :code: o ..

source: Do so by calling:
it_it: Per farlo, chiamare:

source: Do this by filling in the full path to the directory you wish his access to be limited to in the applicable ``LV_FS_xxx_PATH`` macro in ``lv_conf.h``.
it_it: Per farlo, si inserisce il path completo della directory a cui si desidera limitare l'accesso nella macro ``LV_FS_xxx_PATH`` in ``lv_conf.h``.

source: Docker will interpret the ``Dockerfile`` present in the current working directory.
it_it: Docker interpreterà il ``Dockerfile`` presente nella directory di lavoro corrente.

source: Documentation
it_it: Documentazione

source: Documentation is available online
it_it: Documentazione disponibile online

source: Docutils References (Fundamentals)
it_it: Riferimenti a Docutils (Fondamenti))

source: Does not apply to ``track_cross_place``.
it_it: Non si applica a ``track_cross_place``.

source: Doing so allows *rendering* and *refreshing* the display to become parallel operations.
it_it: In questo modo, il *rendering* e l'*aggiornamento* del display diventano operazioni parallele.

source: Doing so renders custom drawing to a buffer which can be used later as an image or a mask.
it_it: In questo modo, il disegno personalizzato viene renderizzato in un buffer utilizzabile in seguito come immagine o maschera.

source: Doing this will cause the chart to be scrollable in its parent --- the parent container provides the scrollable "view window".
it_it: In questo modo, il grafico sarà "scrollable" [scorrevole] nel suo contenitore padre, ovvero il contenitore padre fornisce la "finestra di visualizzazione" scorrevole.

source: Don't forget to assign one or more input devices to the default group using :cpp:expr:`lv_indev_set_group(my_indev, g)`.
it_it: Non dimenticare di assegnare uno o più dispositivi di input al gruppo di default usando :cpp:expr:`lv_indev_set_group(my_indev, g)`.

source: Don't forget to select the branch where you added your changes.
it_it: Non dimenticare di selezionare il branch in cui sono state aggiunte le modifiche.

source: Double-buffered direct rendering
it_it: Rendering diretto a doppio buffer

source: Double-click on ``RX72N_EnVision_LVGL.scfg`` to activate the ``Configuration Window``.
it_it: Doppio-click su ``RX72N_EnVision_LVGL.scfg`` per attivare la ``Configuration Window``.

source: Double-click on ``configuration.xml``.
it_it: Doppio-click su ``configuration.xml``.

source: Download and install the AC6 compiler from `Arm's website <https://developer.arm.com/Tools%20and%20Software/Arm%20Compiler%20for%20Embedded>`__.
it_it: Scaricare e installare il compilatore AC6 dal `sito web di Arm <https://developer.arm.com/Tools%20and%20Software/Arm%20Compiler%20for%20Embedded>`__.

source: Download and install the required driver for the debugger
it_it: Scaricare e installare il driver necessario per il debugger

source: Download the latest stable version of the `J-Link Software <https://www.segger.com/downloads/jlink>`__.
it_it: Scaricare l'ultima versione stabile del software `J-Link Software <https://www.segger.com/downloads/jlink>`__.

source: Downloading the `.zip` from GitHub doesn't work as it doesn't download the submodules.
it_it: Scaricare il file `.zip` da GitHub non funziona perché non scarica i sottomoduli.

source: Doxygen Comment Specifics
it_it: Specifiche dei Commenti di Doxygen

source: Doxygen adds a "See also" paragraph.
it_it: Doxygen aggiunge un paragrafo "See also" [Vedere anche].

source: Doxygen comments begin with a leading ``/**``.
it_it: I commenti Doxygen iniziano con ``/**``.

source: Doxygen detects files it should pay attention to by them having a ``@file`` command inside a Doxygen comment.
it_it: Doxygen rileva i file a cui prestare attenzione tramite il comando ``@file`` all'interno di un commento Doxygen.

source: Doxygen doesn't need the ``{.c}`` part, but the downstream software does.
it_it: Doxygen non necessita della parte ``{.c}``, ma il software a valle sì.

source: Doxygen is the first program in a chain that generates the online LVGL API documentation from the files in the LVGL repository.
it_it: Doxygen è il primo programma di una catena che genera la documentazione online dell'API LVGL dai file nel repository LVGL.

source: Doxygen needs the blank line to separate "brief" from "detail" portions of the description.
it_it: Doxygen necessita della riga vuota per separare le parti "brevi" da quelle di "dettaglio" della descrizione.

source: Doxygen will not generate a hyperlink to the function's documentation without this.
it_it: Doxygen non genererà un collegamento ipertestuale alla documentazione della funzione senza questo.

source: Doxygen will not parse the file without the ``@file`` command being present.
it_it: Doxygen non analizzerà il file senza il comando ``@file``.

source: Doxygen: used to read Doxygen comments (the API documentation) from the header files.
it_it: Doxygen: utilizzato per leggere i commenti di Doxygen (la documentazione dell'API) dai file header.

source: Draw API
it_it: API di Disegno

source: Draw Buffer(s)
it_it: Buffer di Disegno

source: Draw Descriptors
it_it: Descrittori di Disegno

source: Draw Fancy Letter Effects
it_it: Disegnare Effetti di Lettere Fantasiose

source: Draw Fancy Letter Effects 2
it_it: Disegnare Effetti di Lettere Fantasiose 2

source: Draw Layers
it_it: Layer di Disegno

source: Draw Pipeline
it_it: Pipeline di Disegno

source: Draw Task Evaluation
it_it: Valutazione delle Draw Task

source: Draw Tasks
it_it: Draw Task

source: Draw Tasks are collected in a list and periodically dispatched to Draw Units.
it_it: I Draw Task vengono raccolti in un elenco e periodicamente inviati alle Draw Unit.

source: Draw Tasks: Each Layer has its own list of :ref:`Draw Tasks`
it_it: Draw Task: Ogni layer ha il proprio elenco di :ref:`Draw Tasks`

source: Draw Units
it_it: Draw Unit

source: Draw a label to the canvas
it_it: Disegnare un'etichetta sul canvas

source: Draw a line to the canvas
it_it: Disegnare una linea sul canvas

source: Draw a rectangle to the canvas
it_it: Disegnare un rettangolo sul canvas

source: Draw a triangle to the canvas
it_it: Disegnare un triangolo sul canvas

source: Draw a vector graphic to the canvas
it_it: Disegnare un'immagine vettoriale sul canvas

source: Draw an arc to the canvas
it_it: Disegnare un arco sul canvas

source: Draw an image to the canvas
it_it: Disegnare un'immagine sul canvas

source: Draw arcs (w/ rounded edges).
it_it: Disegnare archi (con bordi arrotondati).

source: Draw buffer(s) are simple array(s) that LVGL uses to render the display's content.
it_it: I buffer di disegno sono semplici array che LVGL utilizza per il rendering del contenuto del display.

source: Draw event
it_it: Evento "Draw"

source: Draw full borders (LV_BORDER_SIDE_FULL).
it_it: Disegnare bordi completi (LV_BORDER_SIDE_FULL).

source: Draw image in **label** or **span** obj with :cpp:type:`lv_imgfont`.
it_it: Disegna l'immagine in un oggetto **label** o **span** con :cpp:type:`lv_imgfont`.

source: Draw label with gradient color
it_it: Disegno di etichette con gradiente di colore

source: Draw letters (blit bitmap letters / raster font).
it_it: Disegnare lettere (lettere bitmap blit / font raster).

source: Draw lines (w/ dash or rounded edges).
it_it: Disegnare linee (con trattini o bordi arrotondati).

source: Draw triangles with color (w/ gradient).
it_it: Disegnare triangoli colorati (con gradiente).

source: Draw-Pipeline Overview
it_it: Panoramica della Pipeline di Disegno

source: Drawing
it_it: Disegno

source: Drawing (also known as :dfn:`rendering`) is writing pixel colors into a buffer where they will be delivered to a display panel as pixels.
it_it: Il "drawing" [disegno] (noto anche come :dfn:`rendering`) consiste nello scrivere i colori dei pixel in un buffer, dove verranno visualizzati come pixel su un pannello di display.

source: Drawing API
it_it: API di Disegno

source: Drawing Events
it_it: Eventi di Disegno

source: Drawing on the Canvas and rotate
it_it: Disegno sul Canvas e rotazione

source: Drive LVGL time-related tasks by calling :cpp:func:`lv_timer_handler` every few milliseconds to manage LVGL timers.
it_it: Gestire le attività LVGL relative al tempo chiamando :cpp:func:`lv_timer_handler` ogni pochi millisecondi per gestire i timer LVGL.

source: Driver Initialization
it_it: Inizializzazione del Driver

source: Driver letter ``'A'`` in this example could be an SD card or an OS filesystem, etc.
it_it: La lettera ``'A'`` in questo esempio potrebbe essere una scheda SD o un filesystem del sistema operativo, ecc.

source: Drivers
it_it: Driver

source: Drivers can be implemented either in C as a MicroPython module, or in pure Python.
it_it: I driver possono essere implementati in C come modulo MicroPython o in Python puro.

source: Drivers that come with LVGL
it_it: Driver inclusi in LVGL

source: Drop down in four directions
it_it: Menù a discesa nelle quattro direzioni

source: Dropdown
it_it: Menù a discesa

source: Due to dependencies among different areas, CPU cores cannot always be fully utilized.
it_it: A causa delle dipendenze tra le diverse aree, i core della CPU non possono sempre essere utilizzati completamente.

source: Due to some the limitations of Arduino's build system you need to copy ``lvgl/examples`` to ``lvgl/src/examples``.
it_it: A causa di alcune limitazioni del sistema di compilazione di Arduino, è necessario copiare ``lvgl/examples`` in ``lvgl/src/examples``.

source: Due to the complexity of the parameters used in GPU calls, incorrect parameters can result in abnormal GPU hardware operation, such as forgetting to add an end symbol to the path or not meeting the alignment requirements for buffer stride.
it_it: A causa della complessità dei parametri utilizzati nelle chiamate della GPU, parametri errati possono causare un funzionamento anomalo dell'hardware della GPU, ad esempio dimenticando di aggiungere un simbolo di fine al path o non rispettando i requisiti di allineamento per il buffer stride.

source: Due to the nature of transformations, the Widget being transformed (and its children) must be rendered first, followed by the transformation step.
it_it: Data la natura delle trasformazioni, il Widget da trasformare (e i suoi elementi secondari) deve essere renderizzato per primo, seguito dalla fase di trasformazione.

source: Due to the use of Windows GDI APIs, the theoretical minimum may be Windows 2000 RTM.
it_it: A causa dell'utilizzo delle API GDI di Windows, la versione minima teorica potrebbe essere Windows 2000 RTM.

source: Due to this in :ref:`flush_callback` typically only a frame buffer address needs to be changed.
it_it: Per questo motivo, in :ref:`flush_callback` in genere è necessario modificare solo l'indirizzo di un frame buffer.

source: Dump Obj Tree
it_it: Dump dell'Obj Tree

source: Dumping a Widget Tree
it_it: Dumping di un Widget Tree

source: During G2D initialization, a new draw unit `lv_draw_g2d_unit_t` will be created with the additional callbacks, if :c:macro:`LV_USE_DRAW_G2D` is set to `1`:
it_it: Durante l'inizializzazione di G2D, verrà creata una nuova unità di disegno `lv_draw_g2d_unit_t` con le callback aggiuntive, se :c:macro:`LV_USE_DRAW_G2D` è impostato a `1`:

source: During LVGL's initialization (:cpp:func:`lv_init`), a list of Draw Units is created.
it_it: Durante l'inizializzazione di LVGL (:cpp:func:`lv_init`), viene creato un elenco di Draw Unit.

source: During PXP initialization, a new draw unit `lv_draw_pxp_unit_t` will be created with the additional callbacks, if :c:macro:`LV_USE_DRAW_PXP` is set to `1`:
it_it: Durante l'inizializzazione del PXP, verrà creata una nuova unità di disegno `lv_draw_pxp_unit_t` con le callback aggiuntive, se :c:macro:`LV_USE_DRAW_PXP` è impostato a `1`:

source: During VGLite initialization, a new draw unit `lv_draw_vglite_unit_t` will be created with the additional callbacks:
it_it: Durante l'inizializzazione di VGLite, verrà creata una nuova unità di disegno `lv_draw_vglite_unit_t` con le callback aggiuntive:

source: During registration, the ``<view>`` of the Component is saved in RAM.
it_it: Durante la registrazione, la ``<view>`` del Componente viene salvata nella RAM.

source: During rendering, for each pixel of your 3D model, the renderer samples the appropriate point from this cube map data to determine lighting color and intensity.
it_it: Durante il rendering, per ogni pixel del modello 3D, il motore di rendering campiona il punto appropriato da questi dati della mappa del cubo per determinare il colore e l'intensità dell'illuminazione.

source: During rendering, the LVGL DMA2D draw unit will take tasks that it can perform.
it_it: Durante il rendering, l'unità di disegno DMA2D di LVGL eseguirà i task che può eseguire.

source: During system initialization, tell LVGL you want that function to copy pixels from rendered pixel-buffers to a particular display by doing the following:
it_it: Durante l'inizializzazione del sistema, indica a LVGL che si vuole che la funzione copi i pixel dai buffer di pixel renderizzati a un display specifico, procedendo come segue:

source: During system initialization, you must do the following for each physical display panel you want LVGL to use:
it_it: Durante l'inizializzazione del sistema, è necessario eseguire le seguenti operazioni per ogni pannello di visualizzazione fisico che si desidera venga utilizzato da LVGL:

source: During system initialization, you must set drawing buffers for LVGL to use for each display.
it_it: Durante l'inizializzazione del sistema, è necessario impostare i buffer di disegno che LVGL utilizzerà per ogni display.

source: During the next build, the LVGL component will be fetched from the component registry and added to the project.
it_it: Durante la build successiva, il componente LVGL verrà recuperato dal registro dei componenti e aggiunto al progetto.

source: Dynamic Positioning
it_it: Posizionamento Dinamico

source: Dynamic Sizing
it_it: Dimensionamento Dinamico

source: Dynamic Translations
it_it: Traduzioni Dinamiche

source: Dynamic data (heap): > 2 KB (> 48 kB is recommended if using many GUI Widgets).
it_it: Dati dinamici (heap): >2 KB (>48 kB consigliati se si utilizzano molti widget GUI).

source: Dynamic language selection
it_it: Selezione dinamica della lingua

source: Dynamic parameter override from host application
it_it: Override dinamico dei parametri dall'applicazione host

source: Dynamically Updating UI Text
it_it: Aggiornamento Dinamico del Testo dell'Interfaccia Utente

source: E.g.
it_it: Ad esempio,

source: E.g. 450 means 45 deg.
it_it: Ad esempio, 450 significa 45 gradi.

source: E.g. :cpp:enumerator:`LV_STATE_PRESSED` was added.
it_it: Ad esempio, è stato aggiunto :cpp:enumerator:`LV_STATE_PRESSED`.

source: E.g. :cpp:expr:`LV_DIR_TOP | LV_DIR_LEFT`.
it_it: Es. :cpp:expr:`LV_DIR_TOP | LV_DIR_LEFT`.

source: E.g. :cpp:expr:`lv_display_set_color_format(disp, LV_COLOR_FORMAT_ARGB8888)`
it_it: Es. :cpp:expr:`lv_display_set_color_format(disp, LV_COLOR_FORMAT_ARGB8888)`

source: E.g. :cpp:expr:`lv_obj_set_size(table, LV_SIZE_CONTENT, LV_SIZE_CONTENT)` automatically sets the Table size to show all columns and rows.
it_it: Ad esempio, :cpp:expr:`lv_obj_set_size(table, LV_SIZE_CONTENT, LV_SIZE_CONTENT)` imposta automaticamente la dimensione della Tabella per visualizzare tutte le colonne e le righe.

source: E.g. Visit https://lvgl.io.
it_it: Ad esempio Visitare https://lvgl.io.

source: E.g. ``0xf287`` for the USB symbol.
it_it: Ad esempio, ``0xf287`` per il simbolo USB.

source: E.g. ``foo="'a' 'b'"``.
it_it: Es. ``foo="'a' 'b'"``.

source: E.g. ``lv_point_t point = {10, 20}``.
it_it: Ad esempio, ``lv_point_t point = {10, 20}``.

source: E.g. ``lv_span_t * span = lv_spangroup_get_child(spangroup, 0)`` will return the first child of the Spangroup.
it_it: Ad esempio ``lv_span_t * span = lv_spangroup_get_child(spangroup, 0)`` restituirà il primo elemento figlio dello Spangroup.

source: E.g. ``uint32_t size = lv_spangroup_get_span_count(spangroup)``
it_it: Ad esempio ``uint32_t size = lv_spangroup_get_span_count(spangroup)``

# E.g. ``{"button1", "button2", " ", "button3", ""}``.
source: E.g. ``{"button1", "button2", "\n", "button3", ""}``.
it_it: Ad esempio ``{"button1", "button2", "\n", "button3", ""}``.

source: E.g. blink time of the cursor on the Text Area or scroll time of a roller.
it_it: Ad esempio, il tempo di lampeggìo del cursore sulla Text Area o il tempo di scorrimento di un roller.

source: E.g. default theme -> custom theme -> dark theme.
it_it: Ad esempio, tema di default -> tema personalizzato -> tema scuro.

source: E.g. flush the items to the right on :cpp:enumerator:`LV_FLEX_FLOW_ROW_WRAP`.
it_it: Ad esempio, allinea gli elementi a destra su :cpp:enumerator:`LV_FLEX_FLOW_ROW_WRAP`.

source: E.g. if the items have different height, align them against the bottom of the track.
it_it: Ad esempio, se gli elementi hanno altezze diverse, li allinea alla parte inferiore della track.

source: E.g. paint it to red on start up.
it_it: Ad esempio, colorarlo in rosso all'avvio.

source: E.g. text set by :cpp:func:`lv_label_set_text` will be "Arabic processed" but :cpp:func:`lv_label_set_text_static` will not.
it_it: Ad esempio Il testo impostato da :cpp:func:`lv_label_set_text` sarà "elaborato in arabo", ma :cpp:func:`lv_label_set_text_static` non lo sarà.

source: E.g. v5.0.0, v6.0.0
it_it: Es. v5.0.0, v6.0.0

source: E.g. v6.1.0, v6.2.0
it_it: Es. v6.1.0, v6.2.0

source: E.g. v6.1.1, v6.1.2
it_it: Es. v6.1.1, v6.1.2

source: E.g., 100 px wide in :cpp:enumerator:`LV_STATE_DEFAULT` but 120 px in :cpp:enumerator:`LV_STATE_PRESSED`.
it_it: Ad esempio, 100 px di larghezza in :cpp:enumerator:`LV_STATE_DEFAULT` ma 120 px in :cpp:enumerator:`LV_STATE_PRESSED`.

source: E.g., if your STM32 model is an STM32U5, the header name will likely be ``"stm32u5xx_hal.h"``.
it_it: Ad esempio, se il modello STM32 è un STM32U5, il nome dell'header sarà probabilmente ``"stm32u5xx_hal.h"``.

source: E.g., make all sliders 100×10 px.
it_it: Ad esempio, impostare tutti i cursori a 100×10 px.

source: E.g., one style sets a widget to 100×50, another overrides only the width.
it_it: Ad esempio, uno stile imposta un widget a 100×50, un altro sovrascrive solo la larghezza.

source: E.g.:
it_it: Ad esempio:

source: E.g.: :cpp:expr:`lv_slider_bind_value()`, :cpp:expr:`lv_label_bind_text()`.
it_it: Ad esempio: :cpp:expr:`lv_slider_bind_value()`, :cpp:expr:`lv_label_bind_text()`.

source: EGL (see :ref:`EGL driver <egl_driver>`)
it_it: EGL (vedere il :ref:`driver EGL <egl_driver>`)

source: EGL Driver
it_it: Driver EGL

source: EGL Support
it_it: Supporto EGL

source: EGL can be used together with the DRM driver for hardware-accelerated rendering.
it_it: EGL può essere utilizzato insieme al driver DRM per il rendering con accelerazione hardware.

source: EGL is a lower-level API that is more closely tied to the underlying drivers of the platform.
it_it: EGL è un'API di livello inferiore, più strettamente legata ai driver sottostanti della piattaforma.

source: EGL with DRM
it_it: EGL con DRM

source: EGL without DRM (Experimental)
it_it: EGL senza DRM (Sperimentale)

source: EPS32-P4 monitor log reports buffer underrun and frame-rate decreases
it_it: Il log del monitor EPS32-P4 segnala "buffer underrun" e diminuzioni del frame rate

source: ESP-IDF Example
it_it: Esempio ESP-IDF

source: ESP-IDF has many, ready-to-use examples like `SPIFFS <https://github.com/espressif/esp-idf/tree/master/examples/storage/spiffsgen>`__ , `SD Card <https://github.com/espressif/esp-idf/tree/master/examples/storage/sd_card/sdspi>`__ and `LittleFS <https://github.com/espressif/esp-idf/tree/master/examples/storage/littlefs>`__ .
it_it: ESP-IDF offre molti esempi pronti all'uso, come `SPIFFS <https://github.com/espressif/esp-idf/tree/master/examples/storage/spiffsgen>`__, `SD Card <https://github.com/espressif/esp-idf/tree/master/examples/storage/sd_card/sdspi>`__ e `LittleFS <https://github.com/espressif/esp-idf/tree/master/examples/storage/littlefs>`__.

source: ESP-IDF uses the standard C file operation functions (``fopen``, ``fread``) in all its storage related APIs.
it_it: ESP-IDF utilizza le funzioni standard C per le operazioni sui file (``fopen``, ``fread``) in tutte le sue API relative all'archiviazione.

source: ESP32 ADC with resistive touch
it_it: ESP32 ADC con touch resistivo

source: ESP32 specific:
it_it: Specifici per ESP32:

source: ESP32-P4 series.
it_it: Le serie ESP32-P4.

source: ESP32: ``lv_tick_set_cb(my_tick_get_cb);``, where ``my_tick_get_cb`` is a wrapper for ``esp_timer_get_time() / 1000;``
it_it: ESP32: ``lv_tick_set_cb(my_tick_get_cb);``, dove ``my_tick_get_cb`` è un wrapper per ``esp_timer_get_time() /1000;``

source: EVE Chip IO Implementation
it_it: Implementazione IO del chip EVE

source: EVE External GPU Renderer
it_it: Renderer GPU esterno EVE

source: EVE Intelligent Displays
it_it: Display intelligenti EVE

source: EVE Register Access
it_it: Accesso al Registro EVE

source: EVE is a type of external GPU IC which accepts high-level drawing commands over SPI and outputs the rendered graphics to a display over parallel RGB.
it_it: EVE è un tipo di circuito integrato GPU esterno che accetta comandi di disegno di alto livello tramite SPI e invia la grafica renderizzata a un display tramite RGB parallelo.

source: Each :ref:`Draw Task <draw tasks>` type has its own draw descriptor type.
it_it: Ogni tipo di :ref:`Task di Disegno <draw tasks>` ha il proprio tipo di descrittore di disegno.

source: Each Component can define its own timeline animations, which can then be played by the Component itself or by any parent Component.
it_it: Ogni componente può definire le proprie animazioni della sequenza temporale, che possono poi essere riprodotte dal componente stesso o da qualsiasi componente padre.

source: Each Draw Task carries all the information required to:
it_it: Ciascun Draw Task contiene tutte le informazioni necessarie per:
